----------------------Basic importing and analysis--------------

In [29]:
import numpy as np
import numpy.random as randn
import pandas as pd
import os

dataset = pd.read_csv('train.csv')
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
dataset.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [19]:
os.getcwd()

'/Users/praneethmunuganti/PycharmProjects/PyLearn1'

In [20]:
#Number of rows
len(dataset)

891

In [67]:
#Structure of the dataset
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [30]:
#General description of the dataset
dataset.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [50]:
#Slicing the dataset
dataset[34:55]  #select rows
dataset[33:44:2] #select rows with an increment of 2
dataset[['Sex', 'Age']] #fetching multiple columns
dataset[['Sex','Age']].head() #fetching multiple columns and first 5 rows
dataset.Age #one column
dataset[3:9][['Sex','Age']] #slicing both rows and columns

      Sex   Age
3  female  35.0
4    male  35.0
5    male   NaN
6    male  54.0
7    male   2.0
8  female  27.0

In [81]:
#creating a new column with a calculation
dataset['NewColumn'] =  dataset.Age * dataset.Fare
dataset.columns

#removing a column
del dataset['NewColumn']
dataset.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [95]:
#To find which data are duplicates

#dataset.duplicated()
#dataset.duplicated(['columnName'])

#To drop duplicate data
#dataset.drop_duplicates

#To drop particular duplicate column
#dataset.drop_duplicates(['columnName'])

#Removing duplicates and keeping the last column
#dataset.drop_duplicates(['columnname',take_last=True])ex

In [112]:
# Exploring variables in the dataset
dataset['Age'].count() #Can be done on numerical and categorical variables
dataset['Age'].max()
dataset['Age'].min()
dataset.groupby(['Sex']).groups.keys()

dict_keys(['female', 'male'])

In [117]:
#No of males in the groupby function
len(dataset.groupby(['Sex']).groups['male'])

577

In [119]:
#Mean of Fare, grouped by Sex
dataset.groupby(['Sex'])['Fare'].mean()

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [121]:
#Number of Survived in each Sex and Sibsp group
dataset.groupby(['Sex','SibSp'])['Survived'].count()

Sex     SibSp
female  0        174
        1        106
        2         13
        3         11
        4          6
        5          1
        8          3
male    0        434
        1        103
        2         15
        3          5
        4         12
        5          4
        8          4
Name: Survived, dtype: int64

In [122]:
#Filtering in a groupby statement
dataset[dataset['Age']>18].groupby(['Sex'])['Survived'].count()

Sex
female    193
male      382
Name: Survived, dtype: int64

In [125]:
#Changing output from groupby - Series or Dataframe
dataset[dataset['Age']>18].groupby(['Sex'])['Survived'].count() #Output is series
dataset[dataset['Age']>18].groupby(['Sex'])[['Survived']].count()

        Survived
Sex
female       193
male         382

In [126]:
#Right format
dataset[dataset['Age']>18].groupby(['Sex'],as_index=False)[['Survived']].count()

      Sex  Survived
0  female       193
1    male       382

In [130]:
#Multiple aggregations on grouped dataset
dataset.groupby('Sex',as_index=False).agg({'Survived':"count",'Fare':[sum,min,max]})

      Sex Survived        Fare
             count         sum   min       max
0  female      314  13966.6628  6.75  512.3292
1    male      577  14727.2865  0.00  512.3292